# -----------------------------------------------------------------------------
# Iterator::BidirectionalIterator
# -----------------------------------------------------------------------------
# $Id$
# -----------------------------------------------------------------------------
# これらのクラスはそれぞれの操作が行なえる事を示すために用いられる抽象クラスです。
# インスタンスを生成する事は出来ません。
# -----------------------------------------------------------------------------
package Iterator::BidirectionalIterator;
use strict;
use warnings;
use base qw(Iterator::ForwardIterator Iterator::BackwardIterator);
1;
